Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་འདི་སྔོན་ཆེ་གེ་མོ་ཞེས་བྱ་བ་ཞིག་ཏུ་བྱུང་སྟེ མིང་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། རིགས་ནི་འདི་ཞེས་བྱ། ཁ་དོག་ནི་འདི་ལྟ་བུ། ཆ་བྱད་ནི་འདི་ལྟ་བུ། དབྱིབས་ནི་འདི་ལྟ་བུ། ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ། ཡུན་ནི་འདི་སྲིད་ཅིག་ཏུ་གནས་གནས། བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་སྟེ། དེ་ནས་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་ཏེ། དེ་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་སོ། ། ཞེས་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། ། དེ་ལྟར་ན་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་གནས་རྣམ་པ་དང་བཅས་པ་དང་། ཡུལ་ཕྱོགས་དང་བཅས་པ་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། ། དེ་བདག་གི་སྔོན་གྱི་མཐའ་ནས་བཟུང་སྟེ་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། ། སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་དག་གི་སྔོན་གྱི་མཐའ་ནས་བཟུང་སྟེ་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ནོ། ། དེ་རང་གི་དགེ་བའི་རྩ་བ་སྔོན་གྱི་རྒྱུ་ལས་བྱུང་བ་ཡང་རྗེས་སུ་དྲན་ནོ། ། གཞན་དག་གི་དགེ་བའི་རྩ་བའི་རྒྱུ་ཡང་རྗེས་སུ་དྲན་ནོ། ། དེ་རང་གི་དགེ་བའི་རྩ་བ་ཡང་བྱང་ཆུབ་ཏུ་སྔོ་བར་བྱེད་དོ། ། སེམས་ཅན་གཞན་གྱི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱང་སེམས་ཅན་རྣམས་རྗེས་སུ་དྲན་པར་བྱས་ནས། བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བྱེད་དོ། ། གང་སྔོན་གྱི་བདེ་བ་དང་སྡུག་བསྔལ་གྱི་རྒྱུ་དེ་ཡང་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པར་རྟོན་ཏོ། ། དེ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པ་ལ་རྟོན་པས་གཟུགས་ཀྱིས་དྲེགས་པ་མ་ཡིན། ལོངས་སྤྱོད་ཀྱིས་དྲེགས་པ་མ་ཡིན། གཡོག་གིས་དྲེགས་པ་མ་ཡིན། དབང་ཕྱུག་གིས་དྲེགས་པ་མ་ཡིན། འཁོར་ལོས་སྒྱུར་བ་འདོད་པས་དྲེགས་པ་མ་ཡིན། བརྒྱ་བྱིན་འདོད་པས་དྲེགས་པ་མ་ཡིན། ཚངས་པ་འདོད་པས་དྲེགས་པ་མ་ཡིན། འཇིག་རྟེན་སྐྱོང་བ་འདོད་པས་དྲེགས་པ་མ་ཡིན། སྐྱེ་བ་ཐམས་ཅད་འདོད་པས་དྲེགས་པ་མ་ཡིན། འདོད་པ་དང་། རྒྱལ་པོའི་སྲིད་དང་། དབང་ཕྱུག་གི་བདེ་བ་ཐམས་ཅད་འདོད་པའི་བློ་གྲོས་ཅན་མ་ཡིན་ཏེ། གཞན་དུ་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བསམས་བཞིན་དུ་སྲིད་པ་འཛིན་པ་ནི་མ་གཏོགས་སོ། ། དེ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པ་ལ་རྟོན་པས་སྔོན་གྱི་ཉོན་མོངས་པའི་སྤྱོད་པ་ལ་ཁྲེལ་ཞིང་ངོ་ཚ་བར་བྱེད་སྨོད་པར་བྱེད་དེ། ད་ལྟར་བྱུང་བའི་དངོས་པོས་སྲོག་གི་ཕྱིར་ཡང་མི་དགེ་བའི་རྩ་བར་འགྱུར་བའི་ལས་མི་བྱེད་དོ། ། དེ་སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ཞིང་རྒྱས་པར་བྱེད་དོ། ། ད་ལྟར་གྱི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱང་ཐམས་ཅད་བསྡུས་པའི་ཕྱིར་མི་འཐུན་པའི་བསྔོ་བ་ཡོངས་སུ་སྤངས་ཏེ། སངས་རྒྱས་ཀྱི་རིགས་དང་། ཆོས་ཀྱི་རིགས་དང་། དགེ་འདུན་གྱི་རིགས་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་དྲན་པ་ཡང་དག་པར་བསྐྱེད་པའི་སྟོབས་ཀྱིས་ཐམས་ཅད་མཁྱེན་པར་ཡོངས་སུ་སྔོ་སྟེ།
en: ‘At that time in the past, those sentient beings had these names and these kinds of family. They looked like this, had these genders, and were in these kinds of physical condition. They had these kinds of jobs. They remained alive for that long, and they experienced happiness and suffering in these ways. Then, when they passed away, they took birth again in that place, and when they passed away again they took birth here.’ In this way, he recollects the details and the locations of the multitude of his own various previous states of existence and those of all sentient beings. He recollects his own previous states of existence from the very beginning of time. He recollects the previous states of existence of other sentient beings, of other people, from the very beginning of time. He also recollects the previous causes of his own roots of virtue, and he recollects others’ roots of virtue. He develops his own roots of virtue and his own awakening, and when he recollects other sentient beings’ roots of virtue, he cultivates the mind of awakening. He turns his attention to those causes of happiness and suffering in previous states of existence that arose because of impermanence, suffering, emptiness, and no-self. When he has turned his attention to the fact that they arose because of impermanence, suffering, emptiness, and no-self, he does not become intoxicated by forms. He does not become intoxicated by pleasure. He does not become intoxicated by having followers. He does not become intoxicated by lordship. He does not become intoxicated by the craving to become a king of the entire world. He does not become intoxicated by the craving to become Śakra. He does not become intoxicated by the craving to become Brahmā. He does not become intoxicated by the craving to become a protector of the world. He does not become intoxicated by the craving to be reborn. He does not become intoxicated by a mind filled with craving for all kinds of sensual pleasures or the happiness of kingship or lordship. He does not take hold of existence, except for the purpose of bringing sentient beings to maturity, and only after careful consideration. Because he has already turned his attention to impermanence, suffering, emptiness, and no-self, his conscience and moral sensitivity are disturbed by the actions he has performed because of the vices, and he is repulsed by them. By means of the state of things that is connected to the present, he acted in ways that created roots of nonvirtue, in order to save his life. He causes his previous roots of virtue and his development of unsurpassed perfect awakening to flourish. Because of all the present roots of virtue he has gathered, he avoids dishonesty and deception. So that the lineage of the Buddha, the lineage of the Dharma, and the lineage of the Saṅgha are not destroyed, he develops omniscience.

source: དེའི་དྲན་པ་དེ་ཡང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཤིན་ཏུ་བྱིན་གྱིས་བརླབས་པའོ། ། ཤིན་ཏུ་རིགས་པས་མི་གཡོ་བའོ། ། བསམ་གཏན་ཡོངས་སུ་སྦྱང་བ་བྱས་པས་མ་བརྟགས་པའོ། ། ཞི་གནས་ཀྱིས་ཤིན་ཏུ་བྱིན་གྱིས་བརླབས་པས་གནོད་པ་མེད་པའོ། ། ལྷག་མཐོང་གིས་ཤིན་ཏུ་ཡང་དག་པར་ཟིན་པས་འཁྲུལ་པ་མེད་པའོ། ། མངོན་སུམ་གྱི་ཕྱིར་ཕལ་པ་མ་ཡིན་པའོ། ། དྲན་པ་མ་ཉམས་པའི་ཕྱིར། བརྗེད་པ་མེད་པའོ། ། བསོད་ནམས་ཀྱི་ཚོགས་ཆེན་པོ་བསགས་པ་དང་། གཞན་ལ་རག་མ་ལས་པའི་ཡེ་ཤེས་ཀྱི་ཚོགས་བསགས་པའི་ཕྱིར་མྱོང་བ་ཆེན་པོའོ། ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཚོགས་བསགས་པའི་ཕྱིར་ཕ་རོལ་ཏུ་སོང་བ་སྟེ། དེ་ལྟར་དྲན་པ་ཡང་དག་པར་བསྐྱེད་པའི་སྟོབས་ཀྱིས་འདས་པ་དང་ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་བརྗེད་པ་མེད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་གནས་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པའོ། །
en: The foundation of his memory is good because he possesses the power of memory and because of the presence of the totality of phenomena in his memory. Because he understands things well, his memory is unshakeable. Because of his conscientious practice of meditation, it is not hurried. Because his foundation of calm abiding meditation is good, it is not rushed. Because he has a good grasp of insight meditation, it is not agitated. Because he sees clearly, it is not unrefined. Because nothing is lost from his memory, it remembers. Because he has accumulated stocks of merit, its knowledge is great. Because he has accumulated stocks of knowledge, it is dependent on anything. Because he has accumulated stocks of all the perfections, it has gone to the other shore. This is how he recollects phenomena that had been lost to memory, by means of the power of his memory and mental composure. This is what is known as the perfected potential of superior ability and knowledge of previous states of existence, which the bodhisatva fully perfects.

source: ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་གྱི་བྱ་བ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ནི་གང་། མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པ་ནི་གང་ཞེ་ན།
en: “What then, Śāriputra, is the superior ability and knowledge of the realization of the application of magical abilities that the bodhisatva possesses? What is the practice of the superior ability and knowledge that he fully perfects?

source: ཤ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདུན་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་སྒོམ་པ་དང་། བརྩོན་འགྲུས་དང་། སེམས་དང་། དཔྱོད་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་སྒོམ་པ་སྟེ། དེ་འདུན་པ་དང་། བརྩོན་འགྲུས་དང་། སེམས་དང་། དཔྱོད་པས་རབ་ཏུ་ཟིན་པའི་ཆོས་རྣམས་འདོད་པ་དང་། སྡུག་པར་བྱེད་པ་དང་། དབང་སྒྱུར་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་པོ་འདི་དག་ཤིན་ཏུ་ཡོངས་སུ་བསྒོམས་པའི་ཕྱིར་རྫུ་འཕྲུལ་རྣམས་མངོན་དུ་ཐོབ་པ་ཡིན་ཏེ དེ་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱི་སྤང་བ་རྣམ་པ་དུ་མ་མྱོང་ངོ་། ། དེའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དེ་དག་ཀྱང་སེམས་ཅན་ལ་ལྟ་བའི་ཕྱིར་ཡོངས་སུ་གོམས་པ་ཡིན་ནོ། ། དེ་གཟུགས་སམ། སྟོབས་སམ། བྱིན་གྱི་རླབས་སམ། རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གང་དང་གང་གིས་སེམས་ཅན་རྣམས་འདུལ་བར་འགྱུར་བའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དེ་དང་དེ་ཉིད་ཉེ་བར་སྟོན་ཏོ། ། དེ་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བ་གང་དང་གང་གིས་སེམས་ཅན་རྣམས་འདུལ་བར་འགྱུར་བའི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བ་དེ་དང་དེ་ཉིད་སྟོན་ཏེ། སངས་རྒྱས་ཀྱི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བའམ། རང་སངས་རྒྱས་ཀྱི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བའམ། ཉན་ཐོས་ཀྱི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བའམ། བརྒྱ་བྱིན་གྱི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བའམ། ཚངས་པའི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བའམ། འཇིག་རྟེན་སྐྱོང་བའི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བའམ། འཁོར་ལོས་སྒྱུར་བའི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བའམ། གཞན་ཡང་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བ་ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བ་གང་དང་གང་གིས་སེམས་ཅན་རྣམས་འདུལ་བར་འགྱུར་བའི་གཟུགས་དང་ཁ་དོག་ཏུ་སྣང་བ་དེ་དང་དེ་ཉིད་སེམས་ཅན་རྣམས་ལ་ཉེ་བར་བསྟན་ནས་ཆོས་སྟོན་ཏོ། །
en: “Here, Śāriputra, the bodhisatva cultivates the foundation of magical ability that has as its condition the eliminative concentration of yearning. He cultivates the foundations of the magical abilities that have as their conditions the eliminative concentrations of vigor, volition, and investigation. By wishing for, developing, and mastering these qualities that are joined with yearning, vigor, volition, and investigation, and by genuinely manifesting these four foundations of magical abilities, he truly attains magical abilities. He enjoys the many eliminations of these miraculous magical abilities. He masters the miraculous magical abilities out of concern for sentient beings. He displays whatever kind of magic will train sentient beings, whether forms, powers, or influence. He displays manifestations of forms and appearance—the manifestation of a buddha, of a pratyekabuddha, of a śrāvaka, of Śakra, of Brahmā, of a protector of the world, and of a king of the entire world, as well as other forms, images, and manifestations, even those of animals—whatever will bring sentient beings to the training. When he has done this, he teaches them the Dharma. He displays whatever powers are needed to train sentient beings who take great pride in their own strength and who are very quick-tempered and extremely arrogant. Even if he displayed the strength of a great champion, a quarter of the strength of Nārāyaṇa, half the strength of Nārāyaṇa, the strength of Nārāyaṇa, enough strength to take hold of Sumeru, the king of mountains, which is six million yojanas high, and throw it a distance of eighty-four thousand yojanas with two fingers, throw it to another world as if it was a gooseberry, the bodhisatva’s strength would not be diminished. The bodhisatva would take as great and vast an amount of water as there is in the whole threefold thousand great thousand worlds and place it at the very summit of the universe for an eon, as if it was placed in the palm of his hand, if this would serve to demonstrate the complete spiritual path.

source: དེ་སྟོབས་སྙེམས་པ་དང་། ཁྲོ་བ་དང་། རྒྱགས་པ་ལྷུར་བྱེད་པའི་སེམས་ཅན་རྣམས་སྟོབས་གང་གིས་འདུལ་བར་བྱ་བའི་སྟོབས་དེ་ཉེ་བར་སྟོན་ཏེ། ཇི་ཙམ་སྲེད་མེད་ཀྱི་བུ་ཆེན་པོའི་སྟོབས་ཙམ་འམ། ཇི་ཙམ་སྲེད་མེད་ཀྱི་བུ་ཆེན་པོའི་སྟོབས་བཞི་ཆ་ཙམ་འམ། ཇི་ཙམ་སྲེད་མེད་ཀྱི་བུ་ཆེན་པོའི་སྟོབས་ཀྱི་ཕྱེད་ཙམ་འམ། ཇི་ཙམ་སྲེད་མེད་ཀྱི་བུ་ཆེན་པོའི་སྟོབས་རངས་པ་ཙམ་འམ། ཇི་ཙམ་སྟོབས་གང་གིས་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་འཕང་དུ་དཔག་ཚད་སྟོང་ཕྲག་བརྒྱ་དྲུག་ཅུ་ཞེང་དུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་པ་སོར་མོ་གཉིས་ཀྱིས་བླངས་ནས་ འཕེན་ཏེ འདི་ལྟ་སྟེ་དཔེར་ན་སྐྱུ་རུ་ར་འབྲུ་གཅིག་བླངས་པ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དུ་འཕངས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེའི་སྟོབས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལྟར་རྒྱ་ཆེ་བ་འདི་ལྟར་ཡངས་པ་འདི་ཆུའི་ཕུང་པོ་ནས་བཟུང་སྟེ། སྲིད་པའི་རྩེ་མོའི་བར་དུ་ལག་མཐིལ་དུ་བཞག་ལ་བསྐལ་པར་འདུག་ཅིང་སྤྱོད་ལམ་ཐམས་ཅད་ཀྱང་སྟོན་པ་དེ་ལྟ་བུའི་སྟོབས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྟོབས་སྙེམས་པ་དང་། ཁྲོ་བ་དང་། རྒྱགས་པ་ལྷུར་བྱེད་པའི་སེམས་ཅན་རྣམས་ལ་སྟོབས་སྙེམས་པ་དང་། ཁྲོ་བ་དང་། རྒྱགས་པ་གཞིལ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། ། དེ་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དེ་དག་གིས་བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་འཐོབ་སྟེ། བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་དེས་གང་བྱིན་གྱིས་བརླབས་པ་དེ་དེ་བཞིན་དུ་འགྱུར་ཏེ། གལ་ཏེ་རྒྱ་མཚོ་ཆེན་པོ་ཕྱུགས་རྗེས་ཀྱི་ཆུ་ཙམ་དུ་བྱིན་གྱིས་བརླབས་ན་དེ་ཕྱུགས་རྗེས་ཀྱི་ཆུ་ཙམ་དུ་གནས་སོ། ། གལ་ཏེ་ཕྱུགས་རྗེས་རྒྱ་མཚོ་ཆེན་པོ་ཙམ་དུ་གྱུར་ཅིག་ཅེ་ན་ཡང་དེ་རྒྱ་མཚོ་ཆེན་པོར་འགྱུར་རོ། ། གལ་ཏེ་སྲེག་པའི་བསྐལ་པ་ཆུའི་ཕུང་པོར་གྱུར་ཅིག ། ཅེས་བྱིན་གྱིས་བརླབས་ན་ཡང་དེ་དེ་བཞིན་དུ་ཆུའི་ཕུང་པོར་འགྱུར་རོ། ། ཆུས་འཇིག་པ་ཡང་མེས་འཇིག་པར་གྱུར་ཅིག་ཅེས་བྱིན་གྱིས་བརླབས་ན་དེ་དེ་བཞིན་དུ་འགྱུར་རོ། ། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཐ་མ་དང་། རབ་དང་། འབྲིང་གི་ཆོས་རྣམས་ཀྱིས་གང་དང་གང་བྱིན་གྱིས་བརླབས་པའི་བྱིན་གྱི་བརླབས་དེ་དང་དེ་ཐམས་ཅད་དེ་བཞིན་དུ་འགྱུར་ཏེ། གཞན་དུ་མ་ཡིན་ནོ། ། དེའི་བྱིན་གྱི་རླབས་དེ་ ནི་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། ལྷའམ། བརྒྱ་བྱིན་ནམ། བདུད་དམ། ཚངས་པའམ། འཇིག་རྟེན་འདི་ན་གང་གིས་ཀྱང་ཆོས་དང་འཐུན་པས་བསྒུལ་བའམ། བསྐྱོད་པའམ། མི་སྣང་བར་བྱེད་མི་ནུས་ཏེ སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མ་གཏོགས་སོ། ། དེ་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་བསྐྱེད་པ་དེས་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་སྣ་ཚོགས་ལྷུར་བྱེད་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། ། དེའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དེ་དག་ཀྱང་ཉམས་པ་མེད་པའོ། ། བདག་ཉིད་དབང་བའོ། ། བདུད་དང་ཉོན་མོངས་པའི་ཡུལ་ལས་ཤིན་ཏུ་འདས་པའོ། ། སངས་རྒྱས་ཀྱི་ཡུལ་ལ་འཇུག་པའོ། ། སེམས་ཅན་རྣམས་ལ་མི་འཚེ་བར་སྦྱོར་བའོ། ། དགེ་བའི་རྩ་བའི་ཚོགས་ཐམས་ཅད་བསགས་པའོ། ། བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་མི་ཕྱེད་པ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་གྱི་བྱ་བ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །
en: This is the sort of strength with which the bodhisatva teaches the Dharma to sentient beings who take great pride in their own strength, and who are very quick-tempered and extremely arrogant, in order to rid them of their pride in their own strength, their quick temper, and their arrogance. By means of these foundations of magical abilities, he obtains the knowledge of powerful presence. Because he possesses this knowledge of powerful presence, whatever he attends to happens. If he attends to the great ocean as if it were the size of a cow’s hoof print, then it will be the size of a cow’s hoof print. If he attends to a cow’s hoof print as if it were a great ocean, it will become a great ocean. If he attends to the great fire at the end of the eon as if it were a mass of water, then it will become a mass of water. If he attends to the destruction of the world in a mass of water as if it were the destruction of the world in a mass of fire, then it will become so as he attends to it, and so forth. All phenomena, inferior, superior, or average, behave exactly as they should when he attends to them, and not in any other manner. Moreover, his presence cannot be genuinely disturbed, shaken, or obscured by anyone in this world, not by any ascetic, brahmin, or god, not by Śakra, Māra, or Brahmā, or by any other religious tradition in the world, with the exception of the buddhas, the lords. By means of the presence and the power that he possesses, he teaches the Dharma to many different sentient beings of excellent character, who take great joy and delight in his teaching. Moreover, these foundations of magical abilities that he possesses are never-ending and independent. They overcome Māra and the vices. They manifest in the realms of the buddhas. Their application does no harm to sentient beings. They bring about the accumulation of a great store of roots of virtue. They cannot be severed by Māra and his retinue or by the gods. This is what is known as the practice of the realized superior ability and knowledge of the application of magical abilities, which the bodhisatva fully perfects.

source: ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ནི་གང་། ཡེ་ཤེས་ནི་གང་ཞེ་ན། གང་ལྷའི་མིག་གིས་གཟུགས་རྣམས་མཐོང་བ་འདི་ནི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་གཟུགས་སུ་སྣང་བ་རྣམས་ལ་ཟད་པའི་ཆོས་ཉིད་དུ་ཤེས་ཀྱང་མངོན་སུམ་དུ་མི་བྱེད་པ་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། ། གཞན་ཡང་ཤཱ་རིའི་བུ་གང་སྒྲར་གྲགས་པ་ཐམས་ཅད་ཐོས་པ་འདི་ནི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ཐོས་པའི་སྔོན་གྱི་མཐའ་བརྗོད་དུ་མེད་པ་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་རབ་ཏུ་ཤེས་པ་འདི་ནི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་སེམས་འགོག་པར་ཡང་ཤེས་ལ་འགོག་པ་མངོན་སུམ་དུ་ཡང་མི་བྱེད་པ་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། ། ཤཱརིའི་བུ་གཞན་ཡང་གང་སྔོན་གྱི་མཐའ་ལ་ཆགས་པ་མེད་པར་དྲན་པ་འདི་ནི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་དུས་གསུམ་ལ་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་གང་ཞིང་ཐམས་ཅད་དུ་འགྲོ་བ་དང་འོང་བ་འདི་ནི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ཞིང་ནམ་མཁའ་ལྟ་བུར་ཤེས་པ་ལ་འཇུག་པ་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། ། གཞན་ཡང་གང་བཙུན་པའི་ཆོས་ལ་འཇུག་པ་འདི་ནི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ཆོས་མཉམ་པར་མཐོང་བ་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། ། གཞན་ཡང་གང་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཆགས་པར་འགྱུར་བ་འདི་ནི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འདྲེ་བ་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། ། གཞན་ཡང་གང་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ་འདི་ནི་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྫུ་འཕྲུལ་ཤེས་པ་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱ་སྟེ། ཤཱ་རིའི་བུ་དེ་ལྟར་མངོན་པར་ཤེས་པ་དེ་དག་དང་ཡེ་ཤེས་འདི་ནི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་ལས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཞེས་བྱའོ། ། ཤཱ་རིའི་བུ་དེ་ལྟར་ཉོན་མོངས་པའི་སེམས་གཡེང་བ་ཇི་སྙེད་པར་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་གྱི་ཚོགས་དང་། སེམས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་ཀྱང་དེ་ཙམ་མོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་གཡེང་བ་ཇི་སྙེད་པ་དེ་ཙམ་དུ་བྱང་ཆུབ་སེམས་དཔས་བསམ་གཏན་གྱི་ཡན་ལག་གི་ཚོགས་ཡང་དག་པར་བསྡུ་བར་བྱའོ། །
en: “What then, Śāriputra, are the superior abilities of the bodhisatva? What is his knowledge? Seeing forms with his divine sight is his superior ability. To be aware of the perishable nature of manifest form and still not reify it is his knowledge. Moreover, Śāriputra, hearing all the manifestations of sounds is his superior ability. That all that is heard is ultimately inexpressible is his knowledge. Moreover, Śāriputra, he knows the mental activity of all sentient beings, and this is his superior ability. To be aware of the cessation of thought and not reify cessation is his knowledge. Moreover, Śāriputra, his remembering primordial nonattachment is his superior ability. Knowledge that is not attached to the three times is his knowledge. Moreover, Śāriputra, going to and coming from all buddha fields is his superior ability. His manifestation of knowledge in the field of space is his knowledge. Moreover, that he engages with the Dharma of the venerable ones is his superior ability. His vision of the sameness of all Dharma teachings is his knowledge. Moreover, he brings joy to all worlds, and this is his superior ability. He is unaffected by all worlds, and this is his knowledge. Moreover, he overpowers all śakras, brahmās, and protectors of the world, and this is his superior ability. That he knows the magical abilities of all śrāvakas and pratyekabuddhas is his knowledge. These then, Śāriputra, are his superior abilities, and this is his knowledge. This is what is known as the practice of the realized superior abilities and knowledge that he fully perfects.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་ཀྱི་སེམས་ནམ་ཡང་དག་པར་བླངས་ཏེ་དེ་ལ་གནས་པ་དེ་ན་མཉམ་པར་གཞག་པ་ཞེས་བྱ་སྟེ། སེམས་ཅན་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་གཞག་པའོ། ། སེམས་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་གཞག་པའོ། ། བསམ་པ་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་གཞག་པའོ། ། སྦྱོར་བ་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་གཞག་པའོ། ། ལྷག་པའི་བསམ་པ་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་གཞག་པའོ། ། སྦྱིན་པ་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་གཞག་པའོ། ། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་གཞག་པའོ། ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་གཞག་པའོ། ། བྱང་ཆུབ་གང་དང་མཉམ་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་དེ་དང་མཉམ་པའོ། ། སེམས་ཅན་ཐམས་ཅད་གང་དང་མཉམ་པ་ཆོས་ཐམས་ཅད་དེ་དང་མཉམ་པ་སྟེ། གང་མཉམ་པ་དེ་ལ་སྙོམས་པར་ཞུགས་པ་དེ་ནི་སྙོམས་པར་ཞུགས་པ་ཞེས་བྱའོ། ། སྟོང་པ་ཉིད་གང་དང་མཉམ་པ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་མཉམ་པ་སྟེ། མཉམ་པ་དེ་ལ་སྙོམས་པར་ཞུགས་པས་དེའི་ཕྱིར་སྙོམས་པར་ཞུགས་པ་ཞེས་བྱའོ། ། མཚན་མ་མེད་པ་གང་དང་མཉམ་པ་དང་། སྨོན་པ་མེད་པ་གང་དང་མཉམ་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་གང་དང་མཉམ་པའི་མཉམ་པ་དེ་ལ་སྙོམས་པར་ཞུགས་པས་དེའི་ཕྱིར་སྙོམས་པར་ཞུགས་པ་ཞེས་བྱའོ། ། རང་གི་སེམས་མཉམ་པ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་སྙོམས་པར་ཞུགས་པས་དེའི་ཕྱིར་སྙོམས་པར་ཞུགས་པ་ཞེས་བྱའོ། ། ཕན་འདོགས་པ་དང་། གནོད་པར་བྱེད་པ་ཐམས་ཅད་ལ་སེམས་ས་དང་མཉམ་པ། སེམས་ཆུ་དང་མཉམ་པ། སེམས་མེ་དང་མཉམ་པ། སེམས་རླུང་དང་མཉམ་པ། སེམས་ནམ་མཁའ་དང་མཉམ་པ། མི་མཐོ་མི་དམའ་བ། གནས་པ་ཤིན་ཏུ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། སྤྱོད་ལམ་ཐམས་ཅད་དང་མཉམ་པར་གཞག་པ། སྤྱོད་ལམ་མ་བཅོས་པ། རང་བཞིན་གྱིས་སྙོམས་པར་ཞུགས་པ། མི་རྒོད་པ། མི་གཡེང་བ། མི་འཕྱར་བ། མུ་ཅོར་མི་སྨྲ་བ། ཚིག་མ་འཆལ་པ། དོན་ཤེས་པ། ཆོས་ཤེས་པ། དུས་ཤེས་པ། ཚོད་ཤེས་པ། དྲོད་ཤེས་པ། འཇིག་རྟེན་ཐམས་ཅད་དང་འཐུན་པ། འཇིག་རྟེན་དང་མ་འདྲེས་པ། འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ལས་ཡང་དག་པར་འདས་པ། ཉོན་མོངས་པ་ཐམས་ཅད་དང་མ་འདྲེས་པ། འདུ་འཛི་དང་བྲལ་བ། སྤྱོད་ཡུལ་དབེན་པ་སྟེ། དེ་ལྟ་བུའི་ཆོས་ལ་གནས་པ་མཉམ་པར་གཞག་པའི་གནས་ཀྱང་མི་འདོར་ལ་འཇིག་རྟེན་གྱི་བྱ་བ་ཐམས་ཅད་དུ་ཡང་ཀུན་ཏུ་སྣང་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་དང་། ཐབས་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: “Thus, Śāriputra, the bodhisatva’s knowledge of the accumulation of meditation and mental presence is relative to the degree to which minds are disturbed by the vices. The bodhisatva will master the accumulation of meditation relative to the degree to which the minds of sentient beings are disturbed by the vices. Thus, Śāriputra, when the bodhisatva has entered into composure, then he is known to be concentrated. This is a concentration related to the sameness of all sentient beings; the sameness of thoughts; the sameness of resolve; the sameness of practice; the sameness of intentions; the sameness of generosity; the sameness of morality, patient acceptance, vigor, meditation, and wisdom; and the sameness of all phenomena. That which is the same as awakening is the same as all sentient beings. That which is the same as all sentient beings is the same as all phenomena. That which is the same as the attainment of sameness is what is known as attainment. That which is the same as emptiness is the same as all phenomena. That sameness that has been reached is what is known as attainment. That which is the same as freedom from attributes, freedom from aspirations, and freedom from conditioning is the sameness that is known as attainment when it is attained. The attainment of the sameness of all phenomena arises from the sameness of one’s own thoughts. This is what is known as attainment. Everything helpful and everything unhelpful is the same to him in his mind, and so his mind is like earth, water, fire, wind, or space. He stands neither elevated nor subdued. He stands firmly, having attained immovability. He has attained the states of meditative concentration of all forms of spiritual practice. His spiritual practice is natural. He has attained the essential nature of things. He is not raised up or elevated. He is swift. He does not babble. He does not indulge in loose talk. He understands the context. He understands what is correct. He understands what the right time is. He understands what the right moment is. He understands what the right occasion is. He adapts to all worlds but is not corrupted by them. He has transcended the eight worldly concerns. He is not corrupted by any of the vices. He has left society. His sphere is seclusion. In these ways he remains in the state of meditative concentration, does not become disturbed, and still can be seen to perform all kinds of worldly activities. This is the bodhisatva’s perfection of meditation through which he accomplishes wisdom and skillful means.
